In [2]:
import pandas as pd

concat():
el método concat de la lib pandas sirve para concatenar-unir dos DF a lo latgo de un eje,puede ser verticalmente u  horizontalmente.Básicamente pones los DFs uno al lado del otro o abajo modif el param axis y permite modif ciertos parámetros, como el de los índices,añadir keys-títulos,etc,etc

In [4]:
#Creacións de los DFs
df1 = pd.DataFrame({
    'Nombre':['Juan','Gabriel','Alex'],
    'Edad':[21,32,36]    
})

df2 = pd.DataFrame({
    'Nombre':['Pepe','Lionel','Lautaro'],
    'Edad':[23,62,26]    
})

    Nombre  Edad
0     Pepe    23
1   Lionel    62
2  Lautaro    26

In [14]:
#Primero uso de la fn concat()
df_concatenado = pd.concat([df1,df2])#Es un fn de pandas, por eso es que llamamos a pd y los parámetros que son los dfs que queremos unir siempre hay que pasarselos en ese formato.... es forma de lista
df_concatenado

    Nombre  Edad
0     Juan    21
1  Gabriel    32
2     Alex    36
0     Pepe    23
1   Lionel    62
2  Lautaro    26

In [13]:
df_concatenado = pd.concat([df1,df2],ignore_index=True)#Acá a dif de la anterior ocurre que le estamos modif los índices para que no se mantenga los indices originales de cada DF sino que vaya del 0 en adelante y los contabilice bien digamos, esto se hace cambiando el valor del parám ignore_index a True pq de default está en false ya que no ignora los ínidices originales de cada DF
df_concatenado

    Nombre  Edad
0     Juan    21
1  Gabriel    32
2     Alex    36
3     Pepe    23
4   Lionel    62
5  Lautaro    26

In [9]:
df_concatenado = pd.concat([df1,df2],axis=1)#Acá lo que hacemos es cambiar el axis, por ende al cambiarlo del 0 al 1 hacemos que los DF se unan en forma de fila-horizontal y no de columnas-vertical que lo haría con 0 que viene de default
df_concatenado

    Nombre  Edad   Nombre  Edad
0     Juan    21     Pepe    23
1  Gabriel    32   Lionel    62
2     Alex    36  Lautaro    26

In [11]:
df_concatenado = pd.concat([df1,df2],keys=['df1','df2'])#Acá lo que hacemos es meterle el parám keys con sus valores, en este caso le metemos los textos df1 y df2 como título para cada df y poder separarlos visualmente, aun así se le puede poner cualquier nombre como el de abajo...
df_concatenado

        Nombre  Edad
df1 0     Juan    21
    1  Gabriel    32
    2     Alex    36
df2 0     Pepe    23
    1   Lionel    62
    2  Lautaro    26

In [12]:
df_concatenado = pd.concat([df1,df2],keys=['Grupo1','Grupo2'])#Acá cambiamos el nombre del título de cada DF

           Nombre  Edad
Grupo1 0     Juan    21
       1  Gabriel    32
       2     Alex    36
Grupo2 0     Pepe    23
       1   Lionel    62
       2  Lautaro    26